Revit 2027 API
BuiltInFailures.WallFailures.ShouldAdjustWallParameters Property
 The best way to control top and base of the Wall is to modify the Constraints and Offset Parameters in Properties dialog.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ShouldAdjustWallParameters { get; }
Public Shared ReadOnly Property ShouldAdjustWallParameters As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ShouldAdjustWallParameters {
	FailureDefinitionId^ get ();
}
static member ShouldAdjustWallParameters : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace